Revit 2027 API
RevisionsOnSheetUIServiceData.ParamId Property
 the parameter id
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId ParamId { get; }
Public ReadOnly Property ParamId As ElementId
	Get
public:
property ElementId^ ParamId {
	ElementId^ get ();
}
member ParamId : ElementId with get
Property Value
ElementId
See Also
Reference
RevisionsOnSheetUIServiceData Class
Autodesk.Revit.UI Namespace